In [1]:
import pandas as pd

In [2]:
#two main datatypes

#series is one dimensional
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
colors = pd.Series(["Red", "Blue", "white"])
print(series)
print(" ")
print(colors)

0       BMW
1    Toyota
2     Honda
dtype: object

0      Red
1     Blue
2    white
dtype: object

In [5]:
#DataFrame is 2 dimensional, far more common 

car_data = pd.DataFrame({"Car Make": series, "Color": colors})
car_data

  Car Make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  white

In [6]:
#making dataframes using series is time consuming. So we are going to import data.
car_sales = pd.read_csv("car-sales.csv")

In [7]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

## Descirbe data

In [9]:
#attributes
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [12]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [16]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [17]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [27]:
car_sales["Doors"].mean()

4.0

## Viewing and Selecting Data

In [29]:
car_sales.head(3)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [31]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

<h2>.loc and .iloc </h2>

In [32]:
animals = pd.Series(["Cat", "Dog", "Elephant", "Fox", "Giraffe", "Hog"])

In [33]:
animals

0         Cat
1         Dog
2    Elephant
3         Fox
4     Giraffe
5         Hog
dtype: object

In [38]:
#use of index
fruits = pd.Series(["Appel", "Banana", "Guava", "Litchi", "Mango", "Orange"],index = [0, 3, 6, 9, 3, 6])

In [39]:
fruits

0     Appel
3    Banana
6     Guava
9    Litchi
3     Mango
6    Orange
dtype: object

In [40]:
fruits.loc[3]

3    Banana
3     Mango
dtype: object

In [41]:
fruits.iloc[3]

'Litchi'

In [43]:
fruits.iloc[:3]

0     Appel
3    Banana
6     Guava
dtype: object

In [44]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [45]:
car_sales["Make"] == "Toyota"

0     True
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
9    False
Name: Make, dtype: bool

In [46]:
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00